Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: There is one catch: If one of the .cpp files does not contain the word "GetResp", you will get an error and replacing will stop.
es_es: Hay un pequeño problema: Si uno de los archivos .cpp no contiene la palabra «GetResp», obtendrá un error y la ejecución se detendrá.

source: To avoid this, add the "e" flag to the substitute command: >
es_es: Para evitar esto, añada la opción «e» a la orden de sustituir: >

source: Let's break this down in parts.
es_es: Veámoslo por partes.

source: Obviously it starts with a substitute command.
es_es: Obviamente comienza con la orden «substitute».

source: The "%" is the line range, which stands for the whole file.
es_es: El «%» es el rango de líneas, que se refiere al archivo completo.

source: Thus the substitution is done in every line in the file.
es_es: Por lo tanto la sustitución se producirá en cada línea del archivo.

source: The arguments for the substitute command are "/from/to/".
es_es: Los argumentos para la orden sustituir son «/desde/a/».

source: The slashes separate the "from" pattern and the "to" string.
es_es: Las barras separan el patrón «desde» y la cadena "hacia".

source: This is what the "from" pattern contains: \([^,]*\), \(.*\) ~
es_es: Esto es lo que el patrón «desde» contiene: \([^,]*\), \(.*\) ~

source: The first part between \( \) matches "Last" \( \) match anything but a comma [^,] any number of times * matches ", " literally , The second part between \( \) matches "First" \( \) any character .
es_es: La primera parte entre \( \) concuerda «Último» \( \) concordar cualquier cosa excepto una coma [^,] cualquier número de veces * concuerda literalmente ", " , La segunda parte entre \( \) concuerda «Primero» \( \) cualquier carácter .

source: any number of times *
es_es: cualquier número de veces *

source: In the "to" part we have "\2" and "\1".
es_es: En la parte «a» tenemos «\2» y «\1».

source: These are called backreferences.
es_es: A esto se le llaman referencias «inversas».

source: They refer to the text matched by the "\( \)" parts in the pattern.
es_es: Se refieren al texto encontrado por los «\( \)» del patrón.

source: "\2" refers to the text matched by the second "\( \)", which is the "First" name.
es_es: «\2» se refiere al texto del segundo «\( \)», que es el nombre «Primero».

source: "\1" refers to the first "\( \)", which is the "Last" name.
es_es: «\1» se refiere al primer «\( \)», que es el nombre «Último».

source: You can use up to nine backreferences in the "to" part of a substitute command.
es_es: Puede usar hasta nueve referencias «inversas» en la parte «a» de una orden de sustitución.

source: "\0" stands for the whole matched pattern.
es_es: «\0x se refiere a la cadena coincidente completa.

source: There are a few more special items in a substitute command, see |sub-replace-special|.
es_es: Hay otros elementos especiales en una orden sustituir, consulte |sub-replace-special|.

source: In a Makefile you often have a list of files.
es_es: A menudo, en un archivo Makefile tiene una lista de archivos.

source: This goes to the first line, where "OBJS" is the first thing in the line.
es_es: Esto va a la primera línea, donde «OBJS» es lo primero que se encuentra en una línea.

source: Then it goes one line down and filters the lines until the next empty line.
es_es: Luego baja una línea y filtra las líneas hasta encontrar una línea vacía.

source: You could also select the lines in Visual mode and then use "!sort".
es_es: También podría seleccionar las líneas en modo Visual y escribir «!sort».

source: That's easier to type, but more work when there are many lines.
es_es: Es más fácil pero conlleva más trabajo cuando hay muchas líneas.

source: The result is this:
es_es: El resultado es el siguiente:

source: Notice that a backslash at the end of each line is used to indicate the line continues.
es_es: Observe que una barra inversa al final de cada línea se usa para indicar que la línea continúa.

source: After sorting, this is wrong!
es_es: Tras ordenar, está mal puesto.

source: The "backup.o" line that was at the end didn't have a backslash.
es_es: La línea de «backup.o» que estaba al final no tenía una barra inversa.

source: Now that it sorts to another place, it must have a backslash.
es_es: Ahora que se sitúa en otro lugar debe tener una barra inversa.

source: The simplest solution is to add the backslash with "A \<Esc>".
es_es: La solución más sencilla es añadirla con «A \<Esc>».

source: You can keep the backslash in the last line, if you make sure an empty line comes after it.
es_es: Puede mantener la barra en la última línea si se asegura de que una línea en blanco viene justo después.

source: That way you don't have this problem again.
es_es: De este modo no tendrá este problema de nuevo.

source: The |:global| command can be combined with the |:move| command to move all the lines before the first line, resulting in a reversed file.
es_es: La orden «|:global|» se debe combinar con la orden «|:move|» para mover todas las líneas antes de la primera línea, invirtiendo el archivo.

source: The command is: >
es_es: La orden es: >

source: The "^" regular expression matches the beginning of the line (even if the line is blank).
es_es: La expresión regular «^» coincide con el comienzo de línea (incluso si la línea está en blanco).

source: The |:move| command moves the matching line to after the mythical zeroth line, so the current matching line becomes the first line of the file.
es_es: La orden «|:move|» mueve la línea justo después de la mítica «línea cero», de forma que se convierte en la primera línea.

source: As the |:global| command is not confused by the changing line numbering, |:global| proceeds to match all remaining lines of the file and puts each as the first.
es_es: Como la orden «|:global|» no se confunde al cambiar la numeración de las líneas, «|:global|» procede a concordar el resto de líneas del archivo y pone cada una como la primera.

source: This also works on a range of lines.
es_es: Esto también funciona sobre un rango de líneas.

source: First move to above the first line and mark it with "mt".
es_es: Vaya primero a la línea de encima de la primera y márcala con "mt".

source: Then move the cursor to the last line in the range and type: >
es_es: Luego pon el cursor en la última línea del rango y escribe: >

source: Sometimes you have to write a text with a maximum number of words.
es_es: A veces puede escribir un texto con un número máximo de palabras.

source: Vim can count the words for you.
es_es: Vim puede contar las palabras por Ud.

source: When the whole file is what you want to count the words in, use this command: >
es_es: Cuando quiera usar el archivo completo para contar las palabras, use la siguiente orden: >

source: Do not type a space after the g, this is just used here to make the command easy to read.
es_es: No teclee un espacio tras la «g», esto está aquí para hacer que la orden sea fácil de leer.

source: The output looks like this:
es_es: La salida tendrá este aspecto:

source: When the text is only part of a file, you could move to the start of the text, type "g CTRL-G", move to the end of the text, type "g CTRL-G" again, and then use your brain to compute the difference in the word position.
es_es: Cuando el texto sea sólo una parte del archivo, puede ir al comienzo del texto, pulsar «g CTRL-G», ir al final del texto y volver a escribir «g CTRL-G» y usar la cabeza para calcular la diferencia.

source: That's a good exercise, but there is an easier way.
es_es: Es un buen ejercicio, pero hay un modo más sencillo.

source: With Visual mode, select the text you want to count words in.
es_es: En el modo Visual, seleccione el texto sobre el que quiera contar las palabras.

source: Then type g CTRL-G.
es_es: Escriba «g CTRL-G».

source: Vim will run the external "man" program on the word.
es_es: Vim ejecutará el programa externo «man» sobre la palabra.

source: If the man page is found, it is displayed.
es_es: Si se encuentra la página de manual, se mostrará.

source: This uses the normal pager to scroll through the text (mostly the "more" program).
es_es: Esto usa el paginador normal para desplazarse por el texto (con el programa «more»).

source: When you get to the end pressing <Enter> will get you back into Vim.
es_es: Cuando llegue al final, presionando <Intro> le devolverá a Vim.

source: A disadvantage is that you can't see the man page and the text you are working on at the same time.
es_es: Una desventaja es que no puede ver la página de manual y el texto en el que trabaja al mismo tiempo.

source: There is a trick to make the man page appear in a Vim window.
es_es: Hay un truco para hacer que la página de manual aparezca en una ventana de Vim.

source: First, load the man filetype plugin: >
es_es: Primero cargue la extensión del tipo de archivo man: >

source: Put this command in your vimrc file if you intend to do this often.
es_es: Ponga esta orden en su archivo «vimrc» si tiene la intención de hacer esto a menudo.

source: Now you can use the ":Man" command to open a window on a man page: >
es_es: Ahora puede usar «:Man» para ver una página man en una ventana: >

source: You can scroll around and the text is highlighted.
es_es: Puede desplazarse alrededor y el texto se resaltará.

source: This allows you to find the help you were looking for.
es_es: Esto le permite encontrar la ayuda que estaba buscando.

source: Use CTRL-W w to jump to the window with the text you were working on.
es_es: Use «CTRL-W w» para saltar a la ventana con el texto en el que trabajaba.

source: To find a man page in a specific section, put the section number first.
es_es: Para encontrar la página de manual en una sección específica, ponga el número de sección primero.

source: For example, to look in section 3 for "echo": >
es_es: Por ejemplo, para ver «echo» en la sección 3: >

source: To jump to another man page, which is in the text with the typical form "word(1)", press CTRL-] on it.
es_es: Para saltar a otra página de manual, la cuál está en el texto con la forma típica «word(1)», pulse «CTRL-]» sobre ella.

source: Further ":Man" commands will use the same window.
es_es: Otras llamadas a «:Man» emplearán la misma ventana.

source: (If you redefined the <Leader>, use it instead of the backslash).
es_es: (Si ha redefinido <Leader>, úselo en lugar de la barra inversa).

source: For example, you want to know the return value of "strstr()" while editing this line:
es_es: Por ejemplo, puede que quiera saber el valor que le devuelve «strstr()» mientras edita esta línea:

source: Move the cursor to somewhere on "strstr" and type "\K".
es_es: Ponga el cursor en alguna parte de «strstr» y escriba «\K».

source: A window will open to display the man page for strstr().
es_es: Una ventana se abrirá a continuación para mostrar la página de manual de «strstr()».

source: Some people find spaces and tabs at the end of a line useless, wasteful, and ugly.
es_es: Algunas personas encuentran los espacios y los tabuladores al final de línea inútiles y feos.

source: To remove whitespace at the end of every line, execute the following command: >
es_es: Para eliminar el espacio en blanco al final de cada línea, ejecute la siguiente orden: >

source: The line range "%" is used, thus this works on the whole file.
es_es: El rango de línea «%» es empleado, funcionando sobre todo en el archivo completo.

source: The pattern that the ":substitute" command matches with is "\s\+$".
es_es: El patrón que la orden «:substitute» concuerda es el «\s\+$».

source: This finds white space characters (\s), 1 or more of them (\+), before the end-of-line ($).
es_es: Esto encuentra los caracteres en blanco (\s), 1 o más (\+), antes del final de línea ($).

source: Later will be explained how you write patterns like this |usr_27.txt|.
es_es: Más tarde explicaremos cómo se escriben patrones como este |usr_27.txt|.

source: The "to" part of the substitute command is empty: "//".
es_es: La parte «hacia» de la orden de sustituxión está vacía: «//».

source: Thus it replaces with nothing, effectively deleting the matched white space.
es_es: Por lo tanto reemplaza con nada, lo que de hecho elimina el espacio en blanco.

source: Another wasteful use of spaces is placing them before a tab.
es_es: Otro uso desafortunado de los espacios es colocarlos antes de un tabulador.

source: Often these can be deleted without changing the amount of white space.
es_es: A menudo, se pueden eliminar sin cambiar la cantidad de espacio en blanco.

source: But not always!
es_es: ¡Pero no siempre!

source: Therefore, you can best do this manually.
es_es: Por lo tanto, lo mejor es que lo haga a mano.

source: Use this search command: >
es_es: Use esta orden de búsqueda: >

source: You cannot see it, but there is a space before a tab in this command.
es_es: No puede verlo, pero hay un espacio antes de un tabulador en esta orden.

source: Thus it's "/<Space><Tab>".
es_es: De hecho, es «/<Espacio><Tabulador>».

source: Now use "x" to delete the space and check that the amount of white space doesn't change.
es_es: Use ahora «x» para eliminar el espacio y comprobar que la cantidad de espacio en blanco no cambia.

source: You might have to insert a tab if it does change.
es_es: Puede que tenga que insertar un tabulador si cambia.

source: Type "n" to find the next match.
es_es: Teclee «n» para encontrar la próxima coincidencia.

source: Repeat this until no more matches can be found.
es_es: Repita esto hasta que no se encuentren más concordancias.

source: If you are a UNIX user, you can use a combination of Vim and the grep command to edit all the files that contain a given word.
es_es: Si eres un usuario de sistemas UNIX, puede usar una combinación de Vim y «grep» para editar todos los archivos que contengan la palabra dada.

source: This is extremely useful if you are working on a program and want to view or edit all the files that contain a specific variable.
es_es: Esto es extremadamente útil si está trabajando en un programa y quiere ver o editar todos los archivos que contienen una variable específica.

source: For example, suppose you want to edit all the C program files that contain the word "frame_counter".
es_es: Por ejemplo, suponga que desea editar todos los archivos C que contengan la palabra «frame_counter».

source: To do this you use the command: >
es_es: Para hacer esto, use la orden: >

source: The above command only finds the files in which the word is found.
es_es: La orden anterior sólo dice los archivos en los cuáles se encuentra la palabra.

source: You still have to find the word within the files.
es_es: Todavía tendrás que encontrar la palabra entre los archivos.

source: Vim has a built-in command that you can use to search a set of files for a given string.
es_es: Vim tiene una orden integrada que puede usar para buscar una cadena en un conjunto de archivos.

source: If you want to find all occurrences of "error_string" in all C program files, for example, enter the following command: >
es_es: Si desea encontrar todas las coincidencias de «error_string» en todos los archivos C, por ejemplo, introduzca lo siguiente: >

source: This causes Vim to search for the string "error_string" in all the specified files (*.c).
es_es: Esto hace que Vim busque la cadena «error_string» en cada uno de los archivos especificados (*.c).

source: The editor will now open the first file where a match is found and position the cursor on the first matching line.
es_es: El editor abrirá el primer archivo donde se produzca una concordancia y posicionará el cursor en la primera línea coincidente.

source: To go to the next matching line (no matter in what file it is), use the ":cnext" command.
es_es: Para ir a la siguiente línea (no importa en que archivo se encuentre), use la orden «:cnext».

source: To go to the previous match, use the ":cprev" command.
es_es: Para ir a la anterior, use «:cprev».

source: Use ":clist" to see all the matches and where they are.
es_es: Use «:clist» para ver todas las coincidencias y dónde están.

source: The ":grep" command uses the external commands grep (on Unix) or findstr (on Windows).
es_es: La orden «:grep"» usa la orden externa «grep» en Unix y «findstr» en Windows.

source: You can change this by setting the option 'grepprg'.
es_es: Puedes cambiar esto modificando la opción 'grepprg'.

source: *usr_04.txt* For Vim version 7.3.
es_es: *usr_04.esx* Para Vim versión 7.3.

source: Last change: 2008 Sep 06
es_es: Último cambio: 7/6/2008

source: This chapter shows you several ways of making corrections and moving text around.
es_es: Este capítulo le muestra diferentes formas de hacer correcciones y moverse en el texto.

source: It teaches you the three basic ways to change text: operator-motion, Visual mode and text objects.
es_es: Le muestra los tres modos básicos de cambiar texto: operador-movimiento, modo Visual y objetos de texto.

source: In chapter 2 you learned the "x" command to delete a single character.
es_es: En el capítulo 2 aprendió que la orden «x» elimina un único carácter.

source: And using a count: "4x" deletes four characters.
es_es: Y que usar un multiplicador: «4x» elimina cuatro caracteres.

source: The "dw" command deletes a word.
es_es: La orden «dw» elimina una palabra.

source: You may recognize the "w" command as the move word command.
es_es: Reconocerá la orden «w» como el de movimiento sobre palabras.

source: In fact, the "d" command may be followed by any motion command, and it deletes from the current location to the place where the cursor winds up.
es_es: De hecho, la orden «d» se ha completar con una orden de movimiento, y elimina desde la posición actual hasta donde marque el movimiento.

source: The "4w" command, for example, moves the cursor over four words.
es_es: La orden «4w», por ejemplo, mueve el cursor cuatro palabras.

source: The d4w command deletes four words.
es_es: La orden d4w elimina cuatro palabras.

source: Vim only deletes up to the position where the motion takes the cursor.
es_es: Vim sólo elimina hasta la posición donde la orden de movimiento le lleva.

source: That's because Vim knows that you probably don't want to delete the first character of a word.
es_es: Eso es porque Vim sabe que probablemente no desea eliminar la primera letra de una palabra.

source: If you use the "e" command to move to the end of a word, Vim guesses that you do want to include that last character:
es_es: Si usa la orden «ex para desplazarse hasta el final de una palabra, Vim adivina que quiere incluir el último carácter:

source: Whether the character under the cursor is included depends on the command you used to move to that character.
es_es: El que el carácter bajo el cursor se incluya o no depende de la orden de movimiento empleado.

source: The reference manual calls this "exclusive" when the character isn't included and "inclusive" when it is.
es_es: El manual de referencia llama a esto «exclusivo» cuando el carácter no se incluye e «inclusivo» en caso contrario.

source: The "$" command moves to the end of a line.
es_es: La orden «$» le desplaza hasta el final de la línea.

source: The "d$" command deletes from the cursor to the end of the line.
es_es: La orden «d$» elimina desde el cursor hasta el final de la línea.

source: This is an inclusive motion, thus the last character of the line is included in the delete operation:
es_es: Este es un movimiento inclusivo, por lo que el último carácter de la línea se incluye en la operación:

source: There is a pattern here: operator-motion.
es_es: Esto sigue siempre la misma estructura: operador-movimiento.

source: You first type an operator command.
es_es: Primero introduce el operador.

source: For example, "d" is the delete operator.
es_es: Por ejemplo, «d» es el operador de eliminación.

source: Then you type a motion command like "4l" or "w".
es_es: Luego introduce una orden de movimiento «4l» o «w».

source: This way you can operate on any text you can move over.
es_es: De esta manera, puede operar sobre cualquier texto en el que se pueda desplazar.

source: Another operator is "c", change.
es_es: Otro operador es «c», cambiar (change).

source: It acts just like the "d" operator, except it leaves you in Insert mode.
es_es: Actúa justo como el operador «d», excepto que le deja en modo Insertar.

source: For example, "cw" changes a word.
es_es: Por ejemplo «cw» cambia una palabra.

source: Or more specifically, it deletes a word and then puts you in Insert mode.
es_es: Es decir, elimina una palabra y le deja en modo Insertar.

source: If you have paid attention, you will have noticed something strange: The space before "human" isn't deleted.
es_es: Si ha prestado atención, se habrá dado cuenta de que hay algo raro: El espacio antes de «humano» no se ha eliminado.

source: There is a saying that for every problem there is an answer that is simple, clear, and wrong.
es_es: Hay un dicho: para cada problema hay una solución que es simple, clara y errónea.

source: That is the case with the example used here for the "cw" command.
es_es: Este es el caso con el ejemplo usado aquí con la orden «cw».

source: The c operator works just like the d operator, with one exception: "cw".
es_es: El operador «c» funciona justo como el operador «d», con una excepción: «cw».

source: It actually works like "ce", change to end of word.
es_es: De hecho, funciona justo igual que «ce», cambiar hasta el final de la palabra.

source: Thus the space after the word isn't included.
es_es: El espacio después de la palabra no se incluye.

source: This is an exception that dates back to the old Vi.
es_es: Esta excepción data de Vi.

source: Since many people are used to it now, the inconsistency has remained in Vim.
es_es: Ya que mucha gente se ha acostumbrado a ella, ha permanecido con Vim.

source: Like "dd" deletes a whole line, "cc" changes a whole line.
es_es: Del mismo modo que «dd» elimina una línea completa, «cc» la cambia.

source: It keeps the existing indent (leading white space) though.
es_es: Además, mantiene la sangría (los espacios en blanco precedentes).

source: Just like "d$" deletes until the end of the line, "c$" changes until the end of the line.
es_es: Así como «d$» elimina hasta el final de la línea, «c$» la cambia hasta el final.

source: It's like doing "d$" to delete the text and then "a" to start Insert mode and append new text.
es_es: Es como pulsar «d$» para eliminar el texto y luego «a» para activar el modo Insertar y añadir más texto.

source: The commands "3dw" and "d3w" delete three words.
es_es: Las órdenes «3dw» y «d3wx eliminan tres palabras.

source: If you want to get really picky about things, the first command, "3dw", deletes one word three times; the command "d3w" deletes three words once.
es_es: Si quiere ponerse detallista, la primera ordem, «3dw», elimina una palabra tres veces; la orden «d3w» elimina tres palabras de una vez.

source: This is a difference without a distinction.
es_es: Esta diferencia no se puede distinguir.

source: You can actually put in two counts, however.
es_es: Sin embargo, puede poner dos multiplicadores.

source: For example, "3d2w" deletes two words, repeated three times, for a total of six words.
es_es: Por ejemplo «3d2w» elimina dos palabras y lo repite 3 veces, un total de seis palabras.

source: The "r" command is not an operator.
es_es: La orden «r» no es un operador.

source: It waits for you to type a character, and will replace the character under the cursor with it.
es_es: Espera a que introduzca un carácter, y reemplazará el carácter bajo el cursor con él.

source: You could do the same with "cl" or with the "s" command, but with "r" you don't have to press <Esc>
es_es: Puedes hacer lo mismo con la orden «cl» o con «s», pero con «r» no tendrá que pulsar <Esc>
